<script>
export default {
  name: "TasksPage"
};
</script>

<template>
  <div class="container">
    <ul>
      <li>Создайте компоненты для каждого раздела приложения. Например, у вас может быть компонент "Домашняя страница", "О нас", "Контакты" и т. д.
        Создайте маршруты для каждого раздела приложения с использованием Vue Router.
        Реализуйте навигационное меню или компонент, который отображает ссылки на каждый раздел приложения.
        При клике на ссылку в навигационном меню пользователь должен переходить на соответствующий раздел приложения без перезагрузки страницы.
      </li>
      <li>Создайте новый компонент, например, NotFound.vue, который будет представлять страницу с ошибкой 404.
        Обновите файл router.js для добавления маршрута для обработки ошибки 404. Этот маршрут должен соответствовать любому несуществующему маршруту в приложении.
      </li>
      <li>
        Создайте компонент Catalog.vue, который будет отображать список товаров и пагинацию.
        Реализуйте пагинацию, где каждая страница будет содержать определенное количество товаров (например, 10 товаров на страницу).
        Используйте Vue Router для настройки маршрута страницы каталога, который будет принимать номер страницы в качестве динамического сегмента URL.
        При переключении страницы пагинации с помощью клика на номер страницы, должен изменяться параметр в URL и компонент Catalog.vue должен обновляться с соответствующим списком товаров для выбранной страницы.
      </li>
    </ul>
  </div>
</template>

<style scoped lang="scss">
.container {
  @extend .container
}
li {
  &:not(:last-of-type) {
    margin-bottom: 25px;
  }
}
</style>
